<?php
return [

    // nav bar
    
    'home' => 'ទំព័រដើម',
    'system' => 'ប្រព័ន្ធ',
    'user' => 'អ្នកប្រើ',
    'role' => 'តួនាទី',
    'product' => 'ផលិតផល',
    'book' => 'សៀវភៅ',
    'genres' => 'ប្រភេទ',
    'authors' => 'អ្នកនិពន្ធ',
    'inventory' => 'សារពើភ័ណ្ឌ',
    'stock' => 'ស្តុក',
    'supplier' => 'អ្នកផ្គត់ផ្គង់',
    'report' => 'របាយការណ៍',
    'salereport' => 'របាយការណ៍កក់លក់សរុប',
    'cashreport' => 'របាយការណ៍ប្រាក់កំណត់',
    'sale' => 'ការលក់',

     // Dashboard
    'totalbook' => 'សរុបសៀវភៅ',
    'totasale' => 'សរុបការលក់',
    'totaluser' => 'សរុបអ្នកប្រើប្រាស់',

    'viewbook' => 'មើលសៀវភៅ',
    'viewsale' => 'មើលការលក់',
    'viewuser' => 'មើលអ្នកប្រើប្រាស់',

    //User
    'adduser' => 'បន្ថែមអ្នកប្រើប្រាស់ថ្មី',
    'delete' => 'លុប',
    'edit' => 'កែសម្រួល',
    'status' => 'ស្ថានភាព',
    'deleteDelected' => 'លុបដែលបានជ្រើសរើស',
    'searchUser' => 'ស្វែងរកអ្នកប្រើប្រាស់',
    'no' => 'ល.រ',
    'profile' => 'ប្រវត្តិរូប',
    'name' => 'ឈ្មោះ',
    'email' => 'អ៊ីមែល',
    'action' => 'សកម្មភាព',
    'pass' => 'លេខកូដសំម្ងាត់',

    'searchrole' => 'ស្វែងរកតួនាទី',
    'addrole' => 'បន្ថែមតួនាទីថ្មី',

    //Sale
    'all' => 'ទាំងអស់',
    'barcode' => 'លេខកូដបាកូដ',
    'cartEmpty' => 'រទេះទិញទំនិញរបស់អ្នកគ្មានទំនិញ។',
    'subtotal' => 'សរុបរង',
    'total' => 'សរុប',
    'totalItem' => 'សរុប (ទំនិញ)',
    'pay' => 'បង់ប្រាក់',
    'remove' => 'ដកចេញ',

    //Stock
    'searchstock' => 'ស្វែងរកស្តុក',
    'addstock' => 'បន្ថែមស្តុកថ្មី',
    'qty' => 'បរិមាណដែលមាននៅក្នុងដៃ',
    'price' => 'តម្លៃ',
    'const' => 'ថ្លៃដើម',

    //Supplier
    'searchsupp' => 'ស្វែងរកផ្គត់ផ្គង់',
    'addsupp' => 'បន្ថែមអ្នកផ្គត់ផ្គង់ថ្មី',
    'company' => 'ក្រុមហ៊ុន',
    'phone' => 'លេខទូរស័ព្ទ',
    'adress' => 'អាសយដ្ឋាន',
    'adressen' => 'អាសយដ្ឋាន(ភាសាអង់គ្លេស)',
    'adresskh' => 'អាសយដ្ឋាន(ភាសាខ្មែរ)',

    //Book
    'searchbook' => 'ស្វែងរកសៀវភៅ',
    'addbook' => 'បន្ថែមសៀវភៅថ្មី',
    'coverbook' => 'គម្របសៀវភៅ',
    'title' => 'ចំណងជើង',
    'titlekh' => 'ចំណងជើងជាភាសាខ្មែរ',
    'titlen' => 'ចំណងជើងជាភាសាអង់គ្លេស',
    'save' => 'រក្សាទុក',

    //Author
    'searchauthors' => 'ស្វែងរកអ្នកនិព្ធ',
    'addauthore' => 'បន្ថែមអ្នកនិពន្ធថ្មី',
    'nationality' => 'សញ្ជាតិ',
    'na_kh' => 'សញ្ជាតិ(ជាភាសាអង់គ្លេស)',
    'na_en' => 'សញ្ជាតិ(ជាភាសាខ្មែរ)',

    //genres
    'addgenres' => 'បន្ថែមប្រភេទថ្មី',
    'searchgenres' => 'ស្វែងរកប្រភេទសៀវភៅ',
    'namekh' => 'ឈ្មោះជាភាសាខ្មែរ',
    'namen'=> 'ឈ្មោះជាអង់គ្លេស',



    
];
